#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//int main()//整形提升
//{
//	char a=3;
////3-00000000000000000000000000000011
////a-00000011
//	char b=127;
////127-00000000000000000000000001111111
////  b-01111111
////  00000000000000000000000000000011
////  00000000000000000000000001111111
////  00000000000000000000000010000010
////截断后    c 10000010
////整形提升后c 11111111111111111111111111110000010  补码            
////11111111111111111111111111110000001	反码          
////10000000000000000000000000001111110   原码-126
//	char c=a+b;
//	printf("%d\n",c);//-126
//	return 0;
//}
//int main()
//{
//	char a=0xb6;10110110整形提升就和原来的不相等了
//	short b=0xb600;
//	int c=0xb6000000;
//	if(a==0xb6)
//		printf("a");
//	if(b==0xb600)
//		printf("b");
//	if(c==0xb6000000)
//		printf("c");
//	return 0;
//}
int main()
{
	char c=1;
	printf("%u\n",sizeof(c));//1
	printf("%u\n",sizeof(+c));//4此处进行了整形提升。+进行了运算
	printf("%u\n",sizeof(!c));//1
	return 0;
}