#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
//sizeof
//int main()
//{
//	int a=10;
//	char c='r';
//	char* p=&c;
//	int arr[10]={0};
//	//sizeof:计算变量所占内存空间的大小，单位是字节
//	printf("%d\n",sizeof(a));//4
//	printf("%d\n",sizeof a);//4变量就可以去括号
//	printf("%d\n",sizeof(int));//4类型不可以
//
//	printf("%d\n",sizeof c);//1
//	printf("%d\n",sizeof(char));//1
//
//	printf("%d\n",sizeof(p));//4
//	printf("%d\n",sizeof(char*));//4
//
//	printf("%d\n",sizeof(arr));//40
//	printf("%d\n",sizeof(int[10]));//40去掉变量名就是类型
//	return 0;
//}
//int main()
//{
//	short s=0;
//	int a=10;
//	printf("%d\n",sizeof(s=a+5));//2   s=a+5,就是a+5的数值要放在里面，仍然是s的类型。
//	printf("%d\n",s);//0    sizeof（）括号里面的表达式不会真实进行运算
//	return 0;
//}
//~对一个数的二进制按位取反
int main()
{
//	int a=0;
//	printf("%d\n",a);
//	printf("%d\n",~a);
////a 00000000000000000000000000000000计算机储存的都是补码
////~a11111111111111111111111111111111 按位取反，补码
////  11111111111111111111111111111110 反码=补码-1
////  10000000000000000000000000000001 原码=除符号位，取反即为-1
	int a=11;
//  00000000000000000000000000001011 把倒数第三位的0变为1
//  00000000000000000000000000000100 两者按位与即可
//  1<<1
//  00000000000000000000000000000001
	a=a|(1<<2);
	printf("%d\n",a);
//  00000000000000000000000000001111改回去
//  11111111111111111111111111111011两者按位或
//	00000000000000000000000000000100按位反即可
    a=a&(~(1<<2));
	printf("%d\n",a);
	return 0;
}